In [4]:
import pandas as pd

In [38]:
class_names = pd.read_csv('class_names.csv')
class_names.head()

                   class_name
0  AM General Hummer SUV 2000
1         Acura RL Sedan 2012
2         Acura TL Sedan 2012
3        Acura TL Type-S 2008
4        Acura TSX Sedan 2012

In [39]:
class_index = range(1, 197)

In [40]:
class_names['class_index'] = class_index
class_names.head()

                   class_name  class_index
0  AM General Hummer SUV 2000            1
1         Acura RL Sedan 2012            2
2         Acura TL Sedan 2012            3
3        Acura TL Type-S 2008            4
4        Acura TSX Sedan 2012            5

In [51]:
names = list(class_names['class_name'])
years = []

In [52]:
for name in names:
    year = name[-4:]
    years.append(year)

In [53]:
class_names['year'] = years
class_names.head()

                   class_name  class_index  year
0  AM General Hummer SUV 2000            1  2000
1         Acura RL Sedan 2012            2  2012
2         Acura TL Sedan 2012            3  2012
3        Acura TL Type-S 2008            4  2008
4        Acura TSX Sedan 2012            5  2012

In [54]:
class_names.to_csv('class_names2.csv')